Revit 2026 API

# Transform2DPreScale Method

---

Scales the linear part of this transformation and returns the result.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Transform2D PreScale(
	double scale
)
```
```vb
Public Function PreScale (
	scale As Double
) As Transform2D
```
```cpp
public:
Transform2D^ PreScale(
	double scale
)
```
```fsharp
member PreScale :
        scale : float -> Transform2D
```

#### Parameters

scale Double
     The scale value.

#### Return Value

Transform2D Returns a pointer to "this" Transform2D.

The resulting transformation is equivalent to the application of the uniform scale and then this transformation, in this order.

#### Reference

Transform2D Class

Autodesk.Revit.DB Namespace